import { Data } from '../types/data';

export const data: Data[] = [
  {
    id: 1,
    category: 'Музыка',
    events: [
      {
        id: 1,
        year: 2003,
        description: 'Meteora — Linkin Park.',
      },
      {
        id: 2,
        year: 2004,
        description: 'Распалась группа No Doubt, её солистка Гвен Стефани начала сольную карьеру.',
      },
      {
        id: 3,
        year: 2005,
        description:
          'Расспалась группа Blink 182 (панк-рок, США, образовали Angels & Airwaves и +44).',
      },
      {
        id: 4,
        year: 2007,
        description:
          '«Грэмми» за лучшую рок-песню года — Red Hot Chili Peppers за «Dani California».',
      },
      {
        id: 5,
        year: 2011,
        description:
          '53-я церемония «Грэмми»: 10 номинаций у Эминема и 5 наград у Lady Antebellum.',
      },
      {
        id: 6,
        year: 2013,
        description:
          'Честер Беннингтон становится лидирующим вокалистом группы Stone Temple Pilots, вместо уволенного Скотта Уайланда.',
      },
    ],
  },
  {
    id: 2,
    category: 'Кино',
    events: [
      {
        id: 1,
        year: 1987,
        description: '«Хищник»/Predator, США (реж. Джон Мактирнан).',
      },
      {
        id: 1,
        year: 1988,
        description:
          '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис).',
      },
      {
        id: 2,
        year: 1989,
        description: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис).',
      },
      {
        id: 3,
        year: 1990,
        description: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин).',
      },
      {
        id: 4,
        year: 1991,
        description: '«Семейка Аддамс»/The Addams Family, США, (реж. Барри Зонненфельд)',
      },
    ],
  },
  {
    id: 3,
    category: 'Литература',
    events: [
      {
        id: 1,
        year: 1992,
        description:
          'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах»',
      },
      {
        id: 2,
        year: 1994,
        description: '«Бессоница» - роман Стивена Кинга',
      },
      {
        id: 3,
        year: 1995,
        description: 'Нобелевская премия по литературе - Шеймас Хини',
      },
      {
        id: 4,
        year: 1997,
        description: '«Гарри Поттер и философский камень» - дебютный роман Джоан Роулинг.',
      },
      {
        id: 5,
        year: 1998,
        description:
          'Нобелевская премия по литературе — португальский писатель и поэт Жозе Сарамаго',
      },
      {
        id: 6,
        year: 2003,
        description:
          '«Бессильные мира сего» — роман Бориса Стругацкого, изданный под псевдонимом С. Витицкий.',
      },
    ],
  },
  {
    id: 4,
    category: 'Театр',
    events: [
      {
        id: 1,
        year: 1999,
        description:
          'премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона.',
      },
      {
        id: 2,
        year: 2000,
        description: 'возобновлено издание журнала «Театр».',
      },
      {
        id: 3,
        year: 2002,
        description:
          'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.',
      },
      {
        id: 4,
        year: 2003,
        description:
          'В Венеции после восьмилетней реставрации постановкой оперы Джузеппе Верди «Травиата» открылся театр «Ла Фениче».',
      },
      {
        id: 5,
        year: 2004,
        description:
          'В Московском драматическом театре им. А. С. Пушкина поставлен спектакль «Кот в сапогах» Ш.Перро.',
      },
      {
        id: 6,
        year: 2006,
        description:
          'Режиссёром Андреем Житинкиным поставлен спектакль «Анна Каренина». Премьера состоялась 20 апреля 2006 года в Театриуме на Серпуховке.',
      },
    ],
  },
  {
    id: 5,
    category: 'Спорт',
    events: [
      {
        id: 1,
        year: 1992,
        description: 'Зимние Олимпийские игры 1992.',
      },
      {
        id: 2,
        year: 1993,
        description: 'Чемпионат Европы по фигурному катанию 1993.',
      },
      {
        id: 3,
        year: 1996,
        description: 'Летние Олимпийские игры 1996.',
      },
      {
        id: 4,
        year: 1998,
        description:
          'Чемпионат мира по футболу 1998 — 16-й чемпионат мира по футболу ФИФА, финальная стадия которого прошла во Франции с 10 июня по 12 июля 1998 года.',
      },
      {
        id: 5,
        year: 2001,
        description:
          'НБА в сезоне 2000/2001 — стал 55-м сезоном Национальной баскетбольной ассоциации. «Лос-Анджелес Лейкерс», ведомые Шакилом О’Нилом и Коби Брайантом, очень уверенно победили в плей-офф, выиграв 15 из 16 матчей.',
      },
    ],
  },
  {
    id: 6,
    category: 'Наука',
    events: [
      {
        id: 1,
        year: 2015,
        description:
          '13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды.',
      },
      {
        id: 1,
        year: 2016,
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11.',
      },
      {
        id: 2,
        year: 2017,
        description:
          'Компания Telsa официально представила первый в мире электический грузовик Tesla Semi.',
      },
      {
        id: 3,
        year: 2018,
        description:
          'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца.',
      },
      {
        id: 4,
        year: 2019,
        description: 'Google объявил о создании 53-кубитного квантового компьютера.',
      },
      {
        id: 5,
        year: 2020,
        description: 'корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта.',
      },
      {
        id: 6,
        year: 2021,
        description: 'В Китае развёрнута первая в мире интегрированная сеть квантовой связи',
      },
      {
        id: 7,
        year: 2022,
        description:
          'Первый в Европе квантовый компьютер с более чем 5 000 кубитов запущен в Юлихе, Германия.',
      },
    ],
  },
];
